// Напишите программу вычисления модуля числа.
// 	2 -> 2
// 	-3 -> 3
// 	-7 -> 7

Console.WriteLine("введите число, на выхоже получите противоположное");
int value = Convert.ToInt32(Console.ReadLine());
int eulav = -value;
Console.WriteLine(eulav);